wrk/stage5/wrkGet.txt
wrk -t4 -c128 -d60s -R128 -s ./wrk/get.lua --latency http://localhost:8082
Running 1m test @ http://localhost:8082
  4 threads and 128 connections
  Thread calibration: mean lat.: 1.333ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.236ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.232ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.245ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34ms  759.76us  20.14ms   87.77%
    Req/Sec    33.16     77.48   500.00     85.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.29ms
 75.000%    1.64ms
 90.000%    1.97ms
 99.000%    2.69ms
 99.900%   11.85ms
 99.990%   18.08ms
 99.999%   20.16ms
100.000%   20.16ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.169     0.000000            1         1.00
       0.686     0.100000          628         1.11
       0.860     0.200000         1256         1.25
       1.020     0.300000         1888         1.43
       1.159     0.400000         2512         1.67
       1.286     0.500000         3138         2.00
       1.350     0.550000         3452         2.22
       1.414     0.600000         3766         2.50
       1.486     0.650000         4082         2.86
       1.562     0.700000         4393         3.33
       1.638     0.750000         4705         4.00
       1.676     0.775000         4862         4.44
       1.720     0.800000         5019         5.00
       1.773     0.825000         5178         5.71
       1.824     0.850000         5334         6.67
       1.888     0.875000         5490         8.00
       1.932     0.887500         5571         8.89
       1.968     0.900000         5646        10.00
       2.006     0.912500         5725        11.43
       2.045     0.925000         5805        13.33
       2.117     0.937500         5883        16.00
       2.157     0.943750         5921        17.78
       2.191     0.950000         5961        20.00
       2.233     0.956250         5999        22.86
       2.273     0.962500         6038        26.67
       2.345     0.968750         6078        32.00
       2.363     0.971875         6097        35.56
       2.399     0.975000         6117        40.00
       2.447     0.978125         6138        45.71
       2.489     0.981250         6157        53.33
       2.533     0.984375         6175        64.00
       2.573     0.985938         6185        71.11
       2.609     0.987500         6195        80.00
       2.643     0.989062         6205        91.43
       2.721     0.990625         6215       106.67
       2.763     0.992188         6224       128.00
       2.911     0.992969         6229       142.22
       2.971     0.993750         6234       160.00
       3.083     0.994531         6239       182.86
       3.169     0.995313         6244       213.33
       3.379     0.996094         6249       256.00
       3.741     0.996484         6251       284.44
       4.079     0.996875         6254       320.00
       4.199     0.997266         6256       365.71
       7.003     0.997656         6259       426.67
       7.131     0.998047         6261       512.00
       8.067     0.998242         6262       568.89
       9.271     0.998437         6264       640.00
      11.255     0.998633         6265       731.43
      11.791     0.998828         6266       853.33
      11.855     0.999023         6267      1024.00
      12.047     0.999121         6268      1137.78
      15.631     0.999219         6269      1280.00
      15.631     0.999316         6269      1462.86
      16.559     0.999414         6270      1706.67
      16.559     0.999512         6270      2048.00
      17.439     0.999561         6271      2275.56
      17.439     0.999609         6271      2560.00
      17.439     0.999658         6271      2925.71
      18.079     0.999707         6272      3413.33
      18.079     0.999756         6272      4096.00
      18.079     0.999780         6272      4551.11
      18.079     0.999805         6272      5120.00
      18.079     0.999829         6272      5851.43
      20.159     0.999854         6273      6826.67
      20.159     1.000000         6273          inf
#[Mean    =        1.339, StdDeviation   =        0.760]
#[Max     =       20.144, Total count    =         6273]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7684 requests in 1.00m, 0.93MB read
Requests/sec:    128.05
Transfer/sec:     15.81KB