wrk/stage5/wrkPut1.txt
wrk -t4 -c128 -d180s -R128 -s ./wrk/put2node.lua --latency http://localhost:8081
Running 3m test @ http://localhost:8081
  4 threads and 128 connections
  Thread calibration: mean lat.: 4.517ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.131ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 4.491ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.112ms, rate sampling interval: 33ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.63ms    2.65ms  37.50ms   93.53%
    Req/Sec    33.23    106.36     1.00k    88.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.86ms
 75.000%    3.06ms
 90.000%    4.28ms
 99.000%   14.49ms
 99.900%   21.79ms
 99.990%   23.52ms
 99.999%   37.53ms
100.000%   37.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.189     0.000000            1         1.00
       0.873     0.100000         2164         1.11
       1.128     0.200000         4334         1.25
       1.348     0.300000         6496         1.43
       1.572     0.400000         8654         1.67
       1.857     0.500000        10819         2.00
       2.055     0.550000        11908         2.22
       2.271     0.600000        12982         2.50
       2.529     0.650000        14063         2.86
       2.793     0.700000        15143         3.33
       3.055     0.750000        16231         4.00
       3.203     0.775000        16775         4.44
       3.355     0.800000        17310         5.00
       3.525     0.825000        17854         5.71
       3.705     0.850000        18390         6.67
       3.959     0.875000        18929         8.00
       4.103     0.887500        19199         8.89
       4.275     0.900000        19470        10.00
       4.515     0.912500        19743        11.43
       4.831     0.925000        20012        13.33
       5.447     0.937500        20282        16.00
       5.955     0.943750        20417        17.78
       6.875     0.950000        20554        20.00
       8.503     0.956250        20686        22.86
       9.743     0.962500        20821        26.67
      12.215     0.968750        20958        32.00
      12.639     0.971875        21025        35.56
      12.935     0.975000        21093        40.00
      13.215     0.978125        21160        45.71
      13.431     0.981250        21228        53.33
      13.719     0.984375        21295        64.00
      13.983     0.985938        21329        71.11
      14.159     0.987500        21363        80.00
      14.319     0.989062        21397        91.43
      14.575     0.990625        21430       106.67
      14.807     0.992188        21463       128.00
      14.983     0.992969        21480       142.22
      15.303     0.993750        21497       160.00
      15.663     0.994531        21514       182.86
      16.103     0.995313        21531       213.33
      16.495     0.996094        21548       256.00
      17.039     0.996484        21557       284.44
      17.663     0.996875        21565       320.00
      17.983     0.997266        21573       365.71
      18.335     0.997656        21582       426.67
      18.815     0.998047        21590       512.00
      19.167     0.998242        21594       568.89
      19.551     0.998437        21599       640.00
      19.839     0.998633        21603       731.43
      21.695     0.998828        21607       853.33
      21.887     0.999023        21611      1024.00
      22.031     0.999121        21613      1137.78
      22.383     0.999219        21617      1280.00
      22.399     0.999316        21618      1462.86
      22.495     0.999414        21622      1706.67
      22.495     0.999512        21622      2048.00
      22.575     0.999561        21623      2275.56
      22.687     0.999609        21624      2560.00
      22.767     0.999658        21625      2925.71
      22.783     0.999707        21627      3413.33
      22.783     0.999756        21627      4096.00
      22.799     0.999780        21628      4551.11
      22.799     0.999805        21628      5120.00
      23.391     0.999829        21629      5851.43
      23.391     0.999854        21629      6826.67
      23.519     0.999878        21630      8192.00
      23.519     0.999890        21630      9102.22
      23.519     0.999902        21630     10240.00
      24.047     0.999915        21631     11702.86
      24.047     0.999927        21631     13653.33
      24.047     0.999939        21631     16384.00
      24.047     0.999945        21631     18204.44
      24.047     0.999951        21631     20480.00
      37.535     0.999957        21632     23405.71
      37.535     1.000000        21632          inf
#[Mean    =        2.627, StdDeviation   =        2.650]
#[Max     =       37.504, Total count    =        21632]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  22980 requests in 3.00m, 1.47MB read
Requests/sec:    127.66
Transfer/sec:      8.35KB