wrk/stage5/wrkPut2.txt
wrk -t4 -c128 -d180s -R128 -s ./wrk/put.lua --latency http://localhost:8080
Running 3m test @ http://localhost:8080
  4 threads and 128 connections
  Thread calibration: mean lat.: 1.487ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.468ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.434ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.133ms, rate sampling interval: 14ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.75ms   24.43ms 432.90ms   99.39%
    Req/Sec    33.43    137.66     2.46k    87.93%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.39ms
 75.000%    2.01ms
 90.000%    3.54ms
 99.000%   13.44ms
 99.900%  362.75ms
 99.990%  429.82ms
 99.999%  433.15ms
100.000%  433.15ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.196     0.000000            1         1.00
       0.727     0.100000         2167         1.11
       0.932     0.200000         4332         1.25
       1.098     0.300000         6502         1.43
       1.245     0.400000         8661         1.67
       1.393     0.500000        10819         2.00
       1.479     0.550000        11905         2.22
       1.571     0.600000        12982         2.50
       1.682     0.650000        14073         2.86
       1.823     0.700000        15149         3.33
       2.010     0.750000        16224         4.00
       2.153     0.775000        16766         4.44
       2.331     0.800000        17308         5.00
       2.569     0.825000        17848         5.71
       2.851     0.850000        18388         6.67
       3.179     0.875000        18931         8.00
       3.349     0.887500        19200         8.89
       3.543     0.900000        19471        10.00
       3.763     0.912500        19742        11.43
       4.009     0.925000        20010        13.33
       4.295     0.937500        20282        16.00
       4.491     0.943750        20416        17.78
       4.703     0.950000        20551        20.00
       5.047     0.956250        20686        22.86
       5.723     0.962500        20821        26.67
       6.879     0.968750        20956        32.00
       8.131     0.971875        21024        35.56
      10.607     0.975000        21094        40.00
      11.111     0.978125        21161        45.71
      11.479     0.981250        21228        53.33
      11.983     0.984375        21294        64.00
      12.223     0.985938        21328        71.11
      12.439     0.987500        21362        80.00
      13.159     0.989062        21396        91.43
      13.631     0.990625        21431       106.67
      14.279     0.992188        21463       128.00
      14.663     0.992969        21480       142.22
      24.239     0.993750        21497       160.00
     236.671     0.994531        21514       182.86
     288.255     0.995313        21532       213.33
     308.479     0.996094        21548       256.00
     312.831     0.996484        21556       284.44
     316.927     0.996875        21566       320.00
     324.863     0.997266        21573       365.71
     334.847     0.997656        21582       426.67
     340.991     0.998047        21590       512.00
     344.575     0.998242        21594       568.89
     350.463     0.998437        21600       640.00
     354.815     0.998633        21603       731.43
     360.191     0.998828        21608       853.33
     363.007     0.999023        21613      1024.00
     363.007     0.999121        21613      1137.78
     363.263     0.999219        21616      1280.00
     364.031     0.999316        21618      1462.86
     366.591     0.999414        21622      1706.67
     366.591     0.999512        21622      2048.00
     367.103     0.999561        21623      2275.56
     368.639     0.999609        21624      2560.00
     369.663     0.999658        21625      2925.71
     380.415     0.999707        21627      3413.33
     380.415     0.999756        21627      4096.00
     385.535     0.999780        21628      4551.11
     385.535     0.999805        21628      5120.00
     418.815     0.999829        21629      5851.43
     418.815     0.999854        21629      6826.67
     429.823     0.999878        21630      8192.00
     429.823     0.999890        21630      9102.22
     429.823     0.999902        21630     10240.00
     432.895     0.999915        21631     11702.86
     432.895     0.999927        21631     13653.33
     432.895     0.999939        21631     16384.00
     432.895     0.999945        21631     18204.44
     432.895     0.999951        21631     20480.00
     433.151     0.999957        21632     23405.71
     433.151     1.000000        21632          inf
#[Mean    =        3.754, StdDeviation   =       24.426]
#[Max     =      432.896, Total count    =        21632]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23015 requests in 3.00m, 1.47MB read
  Non-2xx or 3xx responses: 23
Requests/sec:    127.86
Transfer/sec:      8.37KB